EDT/УТ/src/Reports/ОтчетПоКачествуДоставок_Лореаль/ОтчетПоКачествуДоставок_Лореаль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоКачествуДоставок_Лореаль</name>
</mdclass:Report>

EDT/УТ/src/InformationRegisters/СостоянияЗаказов/СостоянияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаНеВыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Экспедитор_КУдалению</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>Водитель_КУдалению</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>СторонаПретензий</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </resources>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Reports/ОтчетПоКачествуДоставок_Лореаль/ObjectModule.bsl
Функция СформироватьОтправитьПоПочте(Период, Контрагент = Неопределено) Экспорт
	
	//Форма = Получитьформу("Отчет.ОтчетКонтроляВремени.Форма.ФормаОтчета");
	//Возврат СформироватьОтчет(ДобавитьМесяц(Период, -1), Справочники.Контрагенты.НайтиПоКоду("Shop_618"));
	Возврат СформироватьОтчет(Период, ?(ЗначениеЗаполнено(Контрагент), Контрагент, Справочники.Контрагенты.НайтиПоКоду("Shop_618")));
	
КонецФункции

//&НаСервере
Функция СформироватьОтчет(ДатаС, Контрагент) Экспорт
	
	Табл = Новый ТабличныйДокумент;
	Макет = Отчеты.ОтчетПоКачествуДоставок_Лореаль.ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ИзменениеДатыДоставки.ДатаДоставки) КАК ПлановаяДатаДоставки,
	               |	ИзменениеДатыДоставки.Доставка.Номер
	               |ПОМЕСТИТЬ ВТ_ПланируемаДата
	               |ИЗ
	               |	Документ.ИзменениеДатыДоставки КАК ИзменениеДатыДоставки
	               |ГДЕ
	               |	ИзменениеДатыДоставки.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНач, ДЕНЬ, -30) И &ДатаКон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИзменениеДатыДоставки.Доставка.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СостоянияЗаказов.ПричинаНеВыполнения,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СостоянияЗаказов.Регистратор) = ТИП(Документ.ИзменениеДатыДоставки)
	               |				И СостоянияЗаказов.ПричинаОтказа = ЗНАЧЕНИЕ(Справочник.ПричиныОтказаПереноса.ПустаяСсылка)
	               |			ТОГДА &ПоВине
	               |		ИНАЧЕ СостоянияЗаказов.ПричинаОтказа
	               |	КОНЕЦ КАК ПричинаОтказа,
	               |	СостоянияЗаказов.Заказ.Ссылка,
	               |	СостоянияЗаказов.Заказ.Номер КАК НомерЗаказаСтриж,
	               |	СостоянияЗаказов.Заказ.НомерВнешнегоЗаказа КАК НомерЗаказа,
	               |	СостоянияЗаказов.Заказ.ТерминалДоставки КАК ТерминалДоставки,
	               |	СостоянияЗаказов.Заказ.Грузополучатель КАК ФИОКлиента,
	               |	СостоянияЗаказов.Доставка.Адрес КАК АдресДоставки,
	               |	СостоянияЗаказов.Период КАК ДатаПереноса
	               |ПОМЕСТИТЬ ВТ_Основная
	               |ИЗ
	               |	РегистрСведений.СостоянияЗаказов КАК СостоянияЗаказов
	               |ГДЕ
	               |	СостоянияЗаказов.Заказ.ПометкаУдаления = ЛОЖЬ
	               |	И СостоянияЗаказов.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.НеВыполнена)
	               |	И СостоянияЗаказов.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |	И (СостоянияЗаказов.Заказ.ВладелецТовара = &ВладелецТовара
	               |			ИЛИ СостоянияЗаказов.Заказ.ВладелецТовара.Родитель.ОсновнойМагазин = &ВладелецТовара)
	               |	И (ТИПЗНАЧЕНИЯ(СостоянияЗаказов.Регистратор) = ТИП(Документ.ИзменениеДатыДоставки)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(СостоянияЗаказов.Регистратор) = ТИП(Документ.новаОтчетВодителя))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗагрузкаСТСДШтрихкоды.Заказ,
	               |	МИНИМУМ(ЗагрузкаСТСДШтрихкоды.Ссылка.Дата) КАК ДатаОтгрузкиЗаказаСоСклада
	               |ПОМЕСТИТЬ ВТ_ДатаОтгрузки
	               |ИЗ
	               |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	               |ГДЕ
	               |	(ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара = &ВладелецТовара
	               |			ИЛИ ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара.Родитель.ОсновнойМагазин = &ВладелецТовара)
	               |	И ЗагрузкаСТСДШтрихкоды.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНач, ДЕНЬ, -30) И &ДатаКон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗагрузкаСТСДШтрихкоды.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Основная.ПричинаОтказа,
	               |	ВТ_Основная.ДатаПереноса КАК ДатаПереноса,
	               |	ВТ_Основная.ПричинаНеВыполнения,
	               |	ВТ_ПланируемаДата.ПлановаяДатаДоставки КАК ПлановаяДатаДоставки,
	               |	ЗакрытыеЗаказы.Период КАК ФактическаяДатаДоставки,
	               |	ВТ_ДатаОтгрузки.ДатаОтгрузкиЗаказаСоСклада,
	               |	ВТ_Основная.НомерЗаказаСтриж КАК НомерЗаказаСтриж,
	               |	ЗакрытыеЗаказы.СтатусЗаказа,
	               |	ВТ_Основная.НомерЗаказа КАК НомерЗаказа,
	               |	ВТ_Основная.ТерминалДоставки,
	               |	ВТ_Основная.ФИОКлиента,
	               |	ВТ_Основная.АдресДоставки КАК АдресДоставки
	               |ИЗ
	               |	ВТ_Основная КАК ВТ_Основная
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаОтгрузки КАК ВТ_ДатаОтгрузки
	               |		ПО ВТ_Основная.ЗаказСсылка = ВТ_ДатаОтгрузки.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланируемаДата КАК ВТ_ПланируемаДата
	               |		ПО ВТ_Основная.НомерЗаказаСтриж = ВТ_ПланируемаДата.ДоставкаНомер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	               |		ПО ВТ_Основная.ЗаказСсылка = ЗакрытыеЗаказы.Реализация
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ЗакрытыеЗаказы.Регистратор) = ТИП(Документ.ЗакрытиеЗаказов)
	               |	И ВТ_ПланируемаДата.ПлановаяДатаДоставки < &ДатаКон
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерЗаказа,
	               |	ДатаПереноса
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДатаС));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ДатаС));
	Запрос.УстановитьПараметр("ПоВине", "По вине контрагента");
	Запрос.УстановитьПараметр("ВладелецТовара", Контрагент);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	П = ОбластьСтрока.Параметры;
	Табл.Вывести(ОбластьШапка);
	Номер = 0;
	Заказ = Неопределено;
	Пока Рез.Следующий() Цикл
		Если Заказ <> Рез.НомерЗаказа Тогда
			Если Номер <> 0 Тогда
				Табл.Вывести(ОбластьСтрока);	
			КонецЕсли;
			Заказ = Рез.НомерЗаказа;
			Номер = Номер + 1;
			П.Номер = Номер;
			П.НомерЗаказа = Заказ;
			П.НомерЗаказаСтриж = Рез.НомерЗаказаСтриж;
			П.ТерминалДоставки = Рез.ТерминалДоставки;
			П.АдресДоставки = Рез.АдресДоставки;
			П.ФИОКлиента = Рез.ФИОКлиента;
			П.ПлановаяДатаДоставки = Формат(Рез.ПлановаяДатаДоставки, "ДЛФ=Д");
			П.ДатаОтгрузкиЗаказаСоСклада = Формат(Рез.ДатаОтгрузкиЗаказаСоСклада, "ДЛФ=Д");
			П.ФактическаяДатаДоставки = Формат(Рез.ФактическаяДатаДоставки, "ДЛФ=Д");
			П.СтатусЗаказа = Рез.СтатусЗаказа;
		    П.Причина = Формат(Рез.ДатаПереноса, "ДЛФ=Д") + " "
				+ Рез.ПричинаНеВыполнения + "/" + Рез.ПричинаОтказа;
		Иначе
			П.Причина = П.Причина + Символы.ПС + Формат(Рез.ДатаПереноса, "ДЛФ=Д") + " "
				+ Рез.ПричинаНеВыполнения + "/" + Рез.ПричинаОтказа;	
		КонецЕсли;		
	КонецЦикла;
	Табл.Вывести(ОбластьСтрока);
	
	Табл.АвтоМасштаб = Истина;	
	Табл.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Возврат Табл;
	
КонецФункции
